Revit 2027 API
SpatialElementGeometryCalculator Constructor
Overload List
Name | Description
SpatialElementGeometryCalculator(Document) |  Constructs a new calculator with default options for the geometry of spatial elements.
SpatialElementGeometryCalculator(Document, SpatialElementBoundaryOptions) |  Constructs a new calculator for the geometry of spatial elements.
Top
See Also
Reference
SpatialElementGeometryCalculator Class
Autodesk.Revit.DB Namespace